-- MySQL dump 10.13  Distrib 5.7.19, for Win64 (x86_64)
--
-- Host: localhost    Database: library
-- ------------------------------------------------------
-- Server version	5.7.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `library`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `library` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `library`;

--
-- Table structure for table `tb_book`
--

DROP TABLE IF EXISTS `tb_book`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tb_book` (
  `bookId` int(50) unsigned NOT NULL AUTO_INCREMENT,
  `bookName` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `bookNumber` bigint(20) NOT NULL DEFAULT '500',
  `bookAuthor` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  `bookPublish` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  `bookPrice` decimal(10,2) DEFAULT NULL,
  `bookType` varchar(20) COLLATE utf8_bin DEFAULT '小说',
  PRIMARY KEY (`bookId`),
  KEY `bookid` (`bookId`)
) ENGINE=InnoDB AUTO_INCREMENT=219 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_book`
--

LOCK TABLES `tb_book` WRITE;
/*!40000 ALTER TABLE `tb_book` DISABLE KEYS */;
INSERT INTO `tb_book` VALUES (2,'理智与情感',485,'奥古','人民出版社',67.80,'散文'),(95,'理智与情感',485,'奥古','人民出版社',67.80,'散文'),(96,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',67.80,'散文'),(97,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(98,'理智与情感',485,'奥古','人民出版社',67.80,'散文'),(99,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',67.80,'散文'),(103,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(104,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(105,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(107,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(108,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(111,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(116,'挪威的森林',481,'村上春树','敦煌文艺出版社',67.80,'小说'),(117,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(118,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(119,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(120,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(121,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(122,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(123,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(124,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(125,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(126,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(127,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(128,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(129,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(130,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(131,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(132,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(133,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(134,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(136,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(137,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(138,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(139,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(140,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(141,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(142,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(143,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(144,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(145,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(146,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(147,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(148,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(149,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(150,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(151,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(152,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(153,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(154,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(155,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(156,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(157,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(158,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(159,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(160,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(161,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(162,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(163,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(164,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(165,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(166,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(167,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(168,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(169,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(170,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(171,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(172,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(173,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(174,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(175,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(176,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(177,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(178,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(179,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(180,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(181,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(182,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(183,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(185,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(186,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(187,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(188,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(189,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(190,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(191,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(192,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(193,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(194,'白鹿原',497,'陈忠实','人民文学出版社',90.90,'小说'),(195,'麦田里的守望者',496,'塞林格','译林出版社',57.90,'小说'),(196,'穆斯林的葬礼',490,'霍达','北京十月文艺出版社',68.90,'小说'),(197,'曹禺剧本选',496,'曹禺','译林出版社',45.90,'小说'),(198,'汤姆叔叔的小屋',491,'斯托夫人','哈尔滨出版社',168.90,'小说'),(199,'挪威的森林',481,'村上春树','敦煌文艺出版社',89.90,'小说'),(200,'白鹿原',497,'陈忠实','人民文学出版社',56.90,'小说'),(201,'凡人修仙传',497,'忘语','原力动画',89.99,'玄幻'),(210,'哈哈哈哈',498,'烦烦烦','沙发沙发',67.00,'小说'),(212,'err3r3',495,'dgeg','dsgwe',78.00,NULL),(213,'会让他华人',499,'然后他然后突然','会突然',67.00,NULL),(214,'会让他华人',499,'然后他然后突然','会突然',67.00,NULL),(215,'会让他华人',499,'然后他然后突然','会突然',67.00,'小说'),(217,'tt4t',500,'ge4','geeg',67.00,'玄幻'),(218,'tt4t',500,'ge4','geeg',67.00,'玄幻');
/*!40000 ALTER TABLE `tb_book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_borrow`
--

DROP TABLE IF EXISTS `tb_borrow`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tb_borrow` (
  `bookName` varchar(50) DEFAULT NULL,
  `bookAuthor` varchar(50) DEFAULT NULL,
  `bookType` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='借书表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_borrow`
--

LOCK TABLES `tb_borrow` WRITE;
/*!40000 ALTER TABLE `tb_borrow` DISABLE KEYS */;
INSERT INTO `tb_borrow` VALUES ('曹禺剧本选','曹禺','小说'),('曹禺剧本选','曹禺','小说'),('白鹿原','陈忠实','小说'),('凡人修仙传','忘语','玄幻'),('曹禺剧本选','曹禺','小说'),('挪威的森林','村上春树','小说'),('挪威的森林','村上春树','小说');
/*!40000 ALTER TABLE `tb_borrow` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `user_name` varchar(50) DEFAULT NULL,
  `pwd` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('bobo','4436'),('weiwei','520'),('啵啵','4436520'),('田维波','4436520');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-11-20 22:23:30
